Autodesk.Revit.DB.LightingSource
Indicates the lighting scheme type in rendering settings.
Since:
2013

Autodesk.Revit.DB.LightingSource.InteriorArtificial
Interior source of light, artificial light only.

Autodesk.Revit.DB.LightingSource.InteriorSunAndArtificial
Interior source of light, sun and artificial light.

Autodesk.Revit.DB.LightingSource.InteriorSun
Interior source of light, sun only.

Autodesk.Revit.DB.LightingSource.ExteriorArtificial
Exterior source of light, artificial light only.

Autodesk.Revit.DB.LightingSource.ExteriorSunAndArtificial
Exterior source of light, sun and artificial light.

Autodesk.Revit.DB.LightingSource.ExteriorSun
Exterior source of light, sun only.